# 04_Data_Integration

## Data marge

In [1]:
import pandas as pd

In [2]:
# Dataset 1
data1 = {
    'NID': [101001, 101002, 101003, 101004, 101005],
    'Name': ['Rakib Hasan', 'Tania Akter', 'Monirul Islam', 'Nusrat Jahan', 'Farhan Mahmud'],
    'Age': [28, 24, 31, 26, 29],
    'District': ['Dhaka', 'Chittagong', 'Rajshahi', 'Khulna', 'Sylhet']
}

In [3]:
df1 = pd.DataFrame(data1)
df1

      NID           Name  Age    District
0  101001    Rakib Hasan   28       Dhaka
1  101002    Tania Akter   24  Chittagong
2  101003  Monirul Islam   31    Rajshahi
3  101004   Nusrat Jahan   26      Khulna
4  101005  Farhan Mahmud   29      Sylhet

In [4]:
# Dataset 2
data2 = {
    'NID': [101001, 101002, 101003, 101005, 101006],
    'Education': ['BSc in CSE', 'MBA', 'HSC', 'MSc in Physics', 'BBA'],
    'Occupation': ['Software Engineer', 'Banker', 'Small Business', 'Lecturer', 'Freelancer'],
    'Married': ['Yes', 'No', 'Yes', 'No', 'No']
}

In [5]:
df2 = pd.DataFrame(data2)
df2

      NID       Education         Occupation Married
0  101001      BSc in CSE  Software Engineer     Yes
1  101002             MBA             Banker      No
2  101003             HSC     Small Business     Yes
3  101005  MSc in Physics           Lecturer      No
4  101006             BBA         Freelancer      No

In [6]:
# Merge (Inner Join)
merged_df = pd.merge(df1, df2, on='NID', how='inner')
merged_df

,NID,Name,Age,District,Education,Occupation,Married
0,101001,Rakib Hasan,28,Dhaka,BSc in CSE,Software Engineer,Yes
1,101002,Tania Akter,24,Chittagong,MBA,Banker,No
2,101003,Monirul Islam,31,Rajshahi,HSC,Small Business,Yes
3,101005,Farhan Mahmud,29,Sylhet,MSc in Physics,Lecturer,No

In [7]:
# Merge (Left Join)
merged_df_left = pd.merge(df1, df2, on='NID', how='left')
merged_df_left

,NID,Name,Age,District,Education,Occupation,Married
0,101001,Rakib Hasan,28,Dhaka,BSc in CSE,Software Engineer,Yes
1,101002,Tania Akter,24,Chittagong,MBA,Banker,No
2,101003,Monirul Islam,31,Rajshahi,HSC,Small Business,Yes
3,101004,Nusrat Jahan,26,Khulna,NaN,NaN,NaN
4,101005,Farhan Mahmud,29,Sylhet,MSc in Physics,Lecturer,No

## Concatenation

In [8]:
import pandas as pd

In [9]:
# Dataset 1
df3 = pd.DataFrame({
    'NID': [101001, 101002],
    'Name': ['Rakib Hasan', 'Tania Akter'],
    'Age': [28, 24],
    'District': ['Dhaka', 'Chittagong']
})

In [10]:
df3

      NID         Name  Age    District
0  101001  Rakib Hasan   28       Dhaka
1  101002  Tania Akter   24  Chittagong

In [11]:
# Dataset 2
df4 = pd.DataFrame({
    'NID': [101003, 101004],
    'Name': ['Monirul Islam', 'Nusrat Jahan'],
    'Age': [31, 26],
    'District': ['Rajshahi', 'Khulna']
})

In [12]:
df4

      NID           Name  Age  District
0  101003  Monirul Islam   31  Rajshahi
1  101004   Nusrat Jahan   26    Khulna

In [13]:
# Concatenate rows (default axis=0)
concat_rows = pd.concat([df3, df4], ignore_index=True)
print("Vertical Concatenation:")
concat_rows

Vertical Concatenation:

      NID           Name  Age    District
0  101001    Rakib Hasan   28       Dhaka
1  101002    Tania Akter   24  Chittagong
2  101003  Monirul Islam   31    Rajshahi
3  101004   Nusrat Jahan   26      Khulna

In [14]:
# Horizontal concat (axis=1)
concat_columns = pd.concat([df3, df4], axis=1)
print("Horizontal Concatenation:\n")
concat_columns

Horizontal Concatenation:

      NID         Name  Age    District     NID           Name  Age  District
0  101001  Rakib Hasan   28       Dhaka  101003  Monirul Islam   31  Rajshahi
1  101002  Tania Akter   24  Chittagong  101004   Nusrat Jahan   26    Khulna